#+Title: Exercise 4.53

With `permanent-set!' as described in *Note Exercise 4-51:: and `if-fail' as in *Note Exercise 4-52::, what will be the result of evaluating

#+BEGIN_SRC scheme :session 4-53 :exports none :results output silent
  (use-modules (ice-9 pretty-print))

  (add-to-load-path (dirname "./"))

  (load "./ambeval.scm")
#+END_SRC


#+BEGIN_SRC scheme :session 4-53 :exports both
  (ambeval-helper
   '(let ((pairs '()))
     (if-fail (let ((p (prime-sum-pair '(1 3 5 8) '(20 35 110))))
                (permanent-set! pairs (cons p pairs))
                (amb))
              pairs)))
#+END_SRC

#+RESULTS:
| 8 |  35 |
| 3 | 110 |
| 3 |  20 |
